In [ ]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error, r2_score, mean_absolute_error
from sklearn.preprocessing import StandardScaler, OneHotEncoder
import seaborn as sns
import matplotlib.pyplot as plt

In [70]:
import tensorflow as tf
from tensorflow import keras
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense, Dropout
from tensorflow.keras.callbacks import EarlyStopping

In [71]:
np.random.seed(42)
tf.random.set_seed(42)

In [72]:
df = pd.read_csv("C:\\Users\\souka\\OneDrive\\Bureau\\code\\Exercice_KNN\\Datasets\\car_price_prediction_.csv")

In [73]:
df.head()  # Affiche les 5 premières lignes
df.shape   # Dimensions : (nombre_lignes, nombre_colonnes)
df.info()  # Types de données et valeurs manquantes
df.describe()  # Statistiques (moyenne, min, max, etc.)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Car ID        2500 non-null   int64
 1   Brand         2500 non-null   object
 2   Year          2500 non-null   int64
 3   Engine Size   2500 non-null   float64
 4   Fuel Type     2500 non-null   object
 5   Transmission  2500 non-null   object
 6   Mileage       2500 non-null   int64
 7   Condition     2500 non-null   object
 8   Price         2500 non-null   float64
 9   Model         2500 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 195.4+ KB

           Car ID       Year  Engine Size        Mileage         Price
count  2500.00000  2500.0000  2500.000000    2500.000000   2500.000000
mean   1250.50000  2011.6268     3.465240  149749.844800  52638.022532
std     721.83216     6.9917     1.432053   87919.952034  27295.833455
min       1.00000  2000.0000     1.000000      15.000000   5011.270000
25%     625.75000  2005.0000     2.200000   71831.500000  28908.485000
50%    1250.50000  2012.0000     3.400000  149085.000000  53485.240000
75%    1875.25000  2018.0000     4.700000  225990.500000  75838.532500
max    2500.00000  2023.0000     6.000000  299967.000000  99982.590000

In [74]:
df.isnull().sum()  # Compte les valeurs manquantes par colonne

Car ID          0
Brand           0
Year            0
Engine Size     0
Fuel Type       0
Transmission    0
Mileage         0
Condition       0
Price           0
Model           0
dtype: int64

In [76]:
df_prep = df.copy()
df_prep = df_prep.drop('Car ID', axis=1)

In [77]:
categorical_cols = ['Brand', 'Fuel Type', 'Transmission', 'Condition', 'Model']
numerical_cols = ['Year', 'Engine Size', 'Mileage']

In [78]:
df_encoded = pd.get_dummies(df_prep, columns=categorical_cols, drop_first=True)

print(f"\nNombre de colonnes après encodage: {df_encoded.shape[1]}")
print(f"Nouvelles colonnes créées: {df_encoded.shape[1] - len(numerical_cols) - 1}")

Nombre de colonnes après encodage: 43
Nouvelles colonnes créées: 39

In [79]:
X = df_encoded.drop('Price', axis=1)
y = df_encoded['Price']
print(f"Dimensions de X: {X.shape}")
print(f"Dimensions de y: {y.shape}")

Dimensions de X: (2500, 42)
Dimensions de y: (2500,)

In [80]:
X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=42
)

In [81]:
scaler = StandardScaler()
X_train_scaled = scaler.fit_transform(X_train)
X_test_scaled = scaler.transform(X_test)